Repository: yevhenii-sumdu/audiobooksyncer
Catalog: sphinx-docs/locale/*/LC_MESSAGES/autoapi/audiobooksyncer/utils/index.po
Languages: uk

source: Various utils for working with files.
uk: Різноманітні утиліти для роботи з файлами.

source: Functions
uk: Функції

source: Save data to a JSON file.
uk: Зберегти дані в JSON-файл.

source: Load data from a JSON file.
uk: Завантажити дані з JSON-файлу.

source: Decorator to cache function output to a JSON file.
uk: Декоратор для кешування виводу функції в JSON-файл.

source: Compute an MD5 hash for the given files.
uk: Обчислити MD5 хеш для заданих файлів.

source: Check if a file is a plain text file based on its MIME type.
uk: Перевірити, чи є файл звичайним текстовим файлом на основі його MIME-типу.

source: Check if a file is an audio file based on its MIME type.
uk: Перевірити, чи є файл аудіофайлом на основі його MIME-типу.

source: Retrieve a sorted list of audio files from a directory.
uk: Отримати відсортований список аудіофайлів з каталогу.

source: Module Contents
uk: Зміст модуля

source: Parameters
uk: Параметри

source: The data to save.
uk: Дані для збереження.

source: Path to the JSON file.
uk: Шлях до JSON-файлу.

source: Returns
uk: Повертає

source: The loaded data.
uk: Завантажені дані.

source: Path to the cache file.
uk: Шлях до файлу кешу.

source: Decorated function with caching.
uk: Декорована функція з кешуванням.

source: Paths to the files to be hashed.
uk: Шляхи до файлів, які потрібно хешувати.

source: Length of the returned hash string (default: 8).
uk: Довжина хеш-рядка, що повертається (за замовчуванням: 8).

source: The computed hash string.
uk: Обчислений хеш-рядок.

source: Path to the file.
uk: Шлях до файлу.

source: True if the file is plain text, False otherwise.
uk: True, якщо файл є звичайним текстом, False у протилежному випадку.

source: True if the file is an audio file, False otherwise.
uk: True, якщо файл є аудіофайлом, False у протилежному випадку.

source: Path to the directory.
uk: Шлях до каталогу.

source: A sorted list of audio file paths.
uk: Відсортований список шляхів до аудіофайлів.
