Repository: yevhenii-sumdu/audiobooksyncer
Catalog: sphinx-docs/locale/*/LC_MESSAGES/autoapi/audiobooksyncer/core/text_audio_aligner/index.po
Languages: uk

source: Functions
uk: Функції

source: Align text fragments with corresponding audio files.
uk: Синхронізувати текстові фрагменти та відповідні аудіо файли.

source: Module Contents
uk: Зміст модуля

source: Parameters
uk: Параметри

source: List of text fragments.
uk: Список текстових фрагментів.

source: List of indexes indicating split points in fragments list.
uk: Список індексів, що вказують на фрагменти, на яких починаються аудіофайли.

source: List of associated audio file paths.
uk: Список відповідних аудіофайлів.

source: Language of the text and audio.
uk: Мова тексту та аудіо.

source: Returns
uk: Повертає

source: Alignment result.
uk: Результат синхронізації.
