Repository: yevhenii-sumdu/audiobooksyncer
Catalog: sphinx-docs/locale/*/LC_MESSAGES/autoapi/audiobooksyncer/scripts/cli/index.po
Languages: uk

source: Functions
uk: Функції

source: Entry for the CLI.
uk: Вхід до CLI.

source: Module Contents
uk: Зміст модуля

source: Parameters
uk: Параметри

source: Path to the source text file.
uk: Шлях до текстового файлу.

source: Path to the translation text file.
uk: Шлях до текстового файлу перекладу.

source: Path to the directory containing audio files.
uk: Шлях до каталогу з аудіофайлами.

source: Number of processes for audio alignment.
uk: Кількість процесів для вирівнювання аудіо.

source: DWT margin for audio alignment.
uk: DWT відступ для вирівнювання аудіо.

source: Flag to automatically confirm prompts.
uk: Параметр для автоматичного підтвердження питань щодо продовження.
