Repository: yevhenii-sumdu/audiobooksyncer
Catalog: sphinx-docs/locale/*/LC_MESSAGES/autoapi/audiobooksyncer/core/utils/index.po
Languages: uk

source: Attributes
uk: Атрибути

source: Functions
uk: Функції

source: Get the duration of an audio file.
uk: Знайти тривалість аудіофайла.

source: Decorate a function to execute it in a separate subprocess.
uk: Обгорнути функцію для її виконання в окремому процесі.

source: Module Contents
uk: Зміст модуля

source: Parameters
uk: Пареметри

source: Path to the audio file.
uk: Шлях до аудіофайла.

source: Returns
uk: Повертає

source: Duration of the audio file in seconds.
uk: Тривалість файлу в секундах.

source: The function to be executed.
uk: Функція, що буде виконуватися.

source: Wrapped function that runs in a subprocess.
uk: Обгорнута функція, яка виконується в підпроцесі.
